Tekla Open API Reference for Tekla Structures 2025
View.ViewShorteningAttributes.MinimumLength Property
 The minimum cut part length.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public double MinimumLength { get; set; }
Public Property MinimumLength As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
View.ViewShorteningAttributes Class
Tekla.Structures.Drawing Namespace